---
kind: method
id: M:Autodesk.Revit.DB.FormattedText.GetMaximumIndentLevel
source: html/3f77a7ca-54e8-28b5-e1e6-cee57afd13e6.htm
---
# Autodesk.Revit.DB.FormattedText.GetMaximumIndentLevel Method

Returns the maximum allowed indent level

## Syntax (C#)
```csharp
public int GetMaximumIndentLevel()
```